#### Import libraries

In [10]:
import pandas as pd

#### Create DataFrame

In [11]:
data = {'name': ['Theresa', 'David', 'Gordon', 'Tony', 'John'],
        'colour': ['Blue', 'Blue', 'Red', 'Red', 'Blue'],
        'score1': [1, 5, 5, 3, 5],
        'score2': [None, 3, 7, 5, 7],
        'score3': [None, 5, 6, 9, None]}

df = pd.DataFrame(data)
df.set_index('name', inplace=True)
df

        colour  score1  score2  score3
name
Theresa   Blue       1     NaN     NaN
David     Blue       5     3.0     5.0
Gordon     Red       5     7.0     6.0
Tony       Red       3     5.0     9.0
John      Blue       5     7.0     NaN

#### Select by label

In [17]:
df.loc['Theresa']

colour    Blue
score1       1
score2     NaN
score3     NaN
Name: Theresa, dtype: object

In [24]:
# Slices can be used to select mupltiple rows
df.loc['David':'Tony']

       colour  score1  score2  score3
name
David    Blue       5     3.0     5.0
Gordon    Red       5     7.0     6.0
Tony      Red       3     5.0     9.0

In [25]:
# We can filter the columns with a second argument
df.loc['David':'Tony', 'score1']

name
David     5
Gordon    5
Tony      3
Name: score1, dtype: int64

In [30]:
# Lists can also be provided
df.loc[['David', 'John'], ['colour', 'score3']]

      colour  score3
name
David   Blue     5.0
John    Blue     NaN

In [40]:
# Single cells can be selected
df.loc['Theresa', 'colour']

'Blue'

#### Select by position

In [28]:
# Same selections as above, but based on position instead
df.iloc[0]

colour    Blue
score1       1
score2     NaN
score3     NaN
Name: Theresa, dtype: object

In [27]:
df.iloc[1:4]

       colour  score1  score2  score3
name
David    Blue       5     3.0     5.0
Gordon    Red       5     7.0     6.0
Tony      Red       3     5.0     9.0

In [29]:
df.iloc[1:4, 1]

name
David     5
Gordon    5
Tony      3
Name: score1, dtype: int64

In [36]:
df.iloc[[1, 4], [0, 3]]

      colour  score3
name
David   Blue     5.0
John    Blue     NaN

In [41]:
df.iloc[0, 0]

'Blue'